// Напишите программу, которая на вход принимает элемент в двумерном массиве, и возвращает индекс этого элемента или же указание, 
//что такого элемента нет. 
//Если элементов несколько, то выводим позицию каждого. Двумерный массив задаётся на ваш выбор.
//1 4 7 2
//5 9 2 3
//8 4 2 4
//17 -> такого числа в массиве нет

Console.WriteLine("Введите число из массива: ");
int[,] array2d = new int[,] {{21,33,15,65,-98,41},{65,36,30,15,-42,74}};
